#include <stdio.h>
#include "menu/menu.h"

//打印欢迎页面
void Welcome(){
    printf("===============================================\n");
    printf("1.用户登录 2.用户注册 3.管理员登录 4.退出程序\n");
    printf("===============================================\n\n");
}
//打印管理员主菜单
void admin_Menu(){
    printf("====================================================================================\n");
    printf("1.查看所有商品 2.搜索商品 3.查看所有订单 4.查看所有用户 5.删除用户 6.下架商品 7.注销\n");
    printf("====================================================================================\n");
}
//打印登录错误页面
void Login_Error(){
    printf("\n**************登录失败！即将返回主菜单***************\n");
    Welcome();
}